app/Controllers/Product.php

    public function addReply()
    {
        if ($this->request->isAJAX()) {
            $komentarId = $this->request->getPost('komentar_id');
            $userId     = session()->get('id');
            $reply      = $this->request->getPost('reply');


            $foto = $this->request->getFile('foto');
            $namaFoto = null;
            if ($foto && $foto->isValid() && !$foto->hasMoved()) {
                $namaFoto = $foto->getRandomName();
                $foto->move(FCPATH . 'uploads/reply', $namaFoto);
            }

            $this->ReplyKomentarModel->save([
                'komentar_idkomentar' => $komentarId,
                'user_iduser'         => $userId,
                'komentar'            => $reply,
                'foto'                => $namaFoto
            ]);
---
INSERT INTO `reply_komentar` (`komentar_idkomentar`, `user_iduser`, `komentar`, `foto`, `created_at`, `updated_at`) VALUES ('9', '3', 'real cuyyy', '1756293067_d92c63b8488eac0d4365.png', '2025-08-27 11:11:07', '2025-08-27 11:11:07')

    public function deleteReply($idreply)
    {
        if ($this->request->isAJAX()) {
            $this->ReplyKomentarModel->delete($idreply);
---
DELETE FROM `reply_komentar`
WHERE `idreply` IN ('4')