app/Models/ModelUser.php

SELECT *
FROM `user`
---
    public function getUser()
    {
        return $this->findAll();

SELECT *
FROM `user`
WHERE `email` = 'fastabee@gmail.com'
---
    public function cekEmail($email)
    {
        return $this->where('email', $email)
            ->get();