app/Models/ModelReplyKomentar.php

    public function getReplyByKomentar($komentarId)
    {
        return $this->select('reply_komentar.*, user.nama')
            ->join('user', 'user.id = reply_komentar.user_iduser', 'left')
            ->where('komentar_idkomentar', $komentarId)
            ->orderBy('created_at', 'ASC')
            ->findAll();
---
SELECT `reply_komentar`.*, `user`.`nama`
FROM `reply_komentar`
LEFT JOIN `user` ON `user`.`id` = `reply_komentar`.`user_iduser`
WHERE `komentar_idkomentar` = '9'
ORDER BY `created_at` ASC