app/Models/ModelProduct.php

    public function getProduct()
    {
        return $this->select('product.*,
        COALESCE(jumlah_komentar.jumlah, 0) + COALESCE(jumlah_reply.jumlah, 0) as total_komentar')
            ->join(
                '(SELECT komentar.product_idproduct, COUNT(komentar.id) as jumlah
                 FROM komentar
                 GROUP BY komentar.product_idproduct) as jumlah_komentar',
                'jumlah_komentar.product_idproduct = product.idproduct',
                'left'
            )
            ->join(
                '(SELECT komentar.product_idproduct, COUNT(reply_komentar.idreply) as jumlah
                 FROM reply_komentar
                 JOIN komentar ON komentar.id = reply_komentar.komentar_idkomentar
                 GROUP BY komentar.product_idproduct) as jumlah_reply',
                'jumlah_reply.product_idproduct = product.idproduct',
                'left'
            )
            ->findAll();
---
SELECT `product`.*, COALESCE(jumlah_komentar.jumlah, 0) + COALESCE(jumlah_reply.jumlah, 0) as total_komentar
FROM `product`
LEFT JOIN (SELECT komentar.product_idproduct, COUNT(komentar.id) as jumlah 
                 FROM komentar 
                 GROUP BY komentar.product_idproduct) as jumlah_komentar ON `jumlah_komentar`.`product_idproduct` = `product`.`idproduct`
LEFT JOIN (SELECT komentar.product_idproduct, COUNT(reply_komentar.idreply) as jumlah 
                 FROM reply_komentar 
                 JOIN komentar ON komentar.id = reply_komentar.komentar_idkomentar 
                 GROUP BY komentar.product_idproduct) as jumlah_reply ON `jumlah_reply`.`product_idproduct` = `product`.`idproduct`

    public function getProductById($idproduct)
    {
        return $this->select('product.*,
        COALESCE(jumlah_komentar.jumlah, 0) + COALESCE(jumlah_reply.jumlah, 0) as total_komentar')
            ->join(
                '(SELECT komentar.product_idproduct, COUNT(komentar.id) as jumlah
              FROM komentar
              GROUP BY komentar.product_idproduct) as jumlah_komentar',
                'jumlah_komentar.product_idproduct = product.idproduct',
                'left'
            )
            ->join(
                '(SELECT komentar.product_idproduct, COUNT(reply_komentar.idreply) as jumlah
              FROM reply_komentar
              JOIN komentar ON komentar.id = reply_komentar.komentar_idkomentar
              GROUP BY komentar.product_idproduct) as jumlah_reply',
                'jumlah_reply.product_idproduct = product.idproduct',
                'left'
            )
            ->where('product.idproduct', $idproduct)
            ->first();
---
SELECT `product`.*, COALESCE(jumlah_komentar.jumlah, 0) + COALESCE(jumlah_reply.jumlah, 0) as total_komentar
FROM `product`
LEFT JOIN (SELECT komentar.product_idproduct, COUNT(komentar.id) as jumlah 
              FROM komentar 
              GROUP BY komentar.product_idproduct) as jumlah_komentar ON `jumlah_komentar`.`product_idproduct` = `product`.`idproduct`
LEFT JOIN (SELECT komentar.product_idproduct, COUNT(reply_komentar.idreply) as jumlah 
              FROM reply_komentar 
              JOIN komentar ON komentar.id = reply_komentar.komentar_idkomentar 
              GROUP BY komentar.product_idproduct) as jumlah_reply ON `jumlah_reply`.`product_idproduct` = `product`.`idproduct`
WHERE `product`.`idproduct` = '1'
 LIMIT 1