app/Models/ModelKomentar.php

SELECT `komentar`.*, `user`.`nama`
FROM `komentar`
JOIN `user` ON `user`.`id` = `komentar`.`user_iduser`
WHERE `komentar`.`product_idproduct` = '1'
ORDER BY `komentar`.`created_at` DESC
---
    public function getKomentarByProduct($productId)
    {
        return $this->select('komentar.*, user.nama')
            ->join('user', 'user.id = komentar.user_iduser')
            ->where('komentar.product_idproduct', $productId)
            ->orderBy('komentar.created_at', 'DESC')
            ->findAll();